Tekla.Structures.ModelInternal.dotPolymeshObject_t
Struct for the surface based model object.

Tekla.Structures.ModelInternal.dotPolymeshObject_t.ModelObject
The object we are extending from

Tekla.Structures.ModelInternal.dotPolymeshObject_t.Polymesh
The polymesh that defines the geometry.